<a href="https://colab.research.google.com/github/KomalMano/Story/blob/master/6_Dummy_Variables_%26_One_Hot_Encoding_code_eg.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [59]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from google.colab import files
import io

In [60]:
uploaded = files.upload()

Saving 6.Dummy Variables & One Hot Encoding_eg.csv to 6.Dummy Variables & One Hot Encoding_eg (4).csv

In [61]:
for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

User uploaded file "6.Dummy Variables & One Hot Encoding_eg.csv" with length 322 bytes

In [62]:
uploaded

{'6.Dummy Variables & One Hot Encoding_eg.csv': b'Car, Mileage,Price,Age\r\nBMW X5,69000,18000,6\r\nBMW X5,35000,34000,3\r\nBMW X5,57000,26100,5\r\nBMW X5,22500,40000,2\r\nBMW X5,46000,31500,4\r\nAudi A5,59000,29400,5\r\nAudi A5,52000,32000,5\r\nAudi A5,72000,19300,6\r\nAudi A5,91000,12000,8\r\nMercedez,67000,22000,6\r\nMercedez,83000,20000,7\r\nMercedez,79000,21000,7\r\nMercedez,59000,33000,5\r\n'}

In [63]:
df = pd.read_csv(io.StringIO(uploaded['6.Dummy Variables & One Hot Encoding_eg.csv'].decode('utf-8')))
df

         Car   Mileage  Price  Age
0     BMW X5     69000  18000    6
1     BMW X5     35000  34000    3
2     BMW X5     57000  26100    5
3     BMW X5     22500  40000    2
4     BMW X5     46000  31500    4
5    Audi A5     59000  29400    5
6    Audi A5     52000  32000    5
7    Audi A5     72000  19300    6
8    Audi A5     91000  12000    8
9   Mercedez     67000  22000    6
10  Mercedez     83000  20000    7
11  Mercedez     79000  21000    7
12  Mercedez     59000  33000    5

In [64]:
dummies = pd.get_dummies(df.Car)
dummies

    Audi A5  BMW X5  Mercedez
0         0       1         0
1         0       1         0
2         0       1         0
3         0       1         0
4         0       1         0
5         1       0         0
6         1       0         0
7         1       0         0
8         1       0         0
9         0       0         1
10        0       0         1
11        0       0         1
12        0       0         1

In [65]:
merged = pd.concat([df,dummies], axis='columns')
merged

         Car   Mileage  Price  Age  Audi A5  BMW X5  Mercedez
0     BMW X5     69000  18000    6        0       1         0
1     BMW X5     35000  34000    3        0       1         0
2     BMW X5     57000  26100    5        0       1         0
3     BMW X5     22500  40000    2        0       1         0
4     BMW X5     46000  31500    4        0       1         0
5    Audi A5     59000  29400    5        1       0         0
6    Audi A5     52000  32000    5        1       0         0
7    Audi A5     72000  19300    6        1       0         0
8    Audi A5     91000  12000    8        1       0         0
9   Mercedez     67000  22000    6        0       0         1
10  Mercedez     83000  20000    7        0       0         1
11  Mercedez     79000  21000    7        0       0         1
12  Mercedez     59000  33000    5        0       0         1

In [66]:
final = merged.drop(['Car','Mercedez'], axis='columns')
final

     Mileage  Price  Age  Audi A5  BMW X5
0      69000  18000    6        0       1
1      35000  34000    3        0       1
2      57000  26100    5        0       1
3      22500  40000    2        0       1
4      46000  31500    4        0       1
5      59000  29400    5        1       0
6      52000  32000    5        1       0
7      72000  19300    6        1       0
8      91000  12000    8        1       0
9      67000  22000    6        0       0
10     83000  20000    7        0       0
11     79000  21000    7        0       0
12     59000  33000    5        0       0

In [67]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [79]:
X = final.drop(['Price'], axis='columns')
X

     Mileage  Age  Audi A5  BMW X5
0      69000    6        0       1
1      35000    3        0       1
2      57000    5        0       1
3      22500    2        0       1
4      46000    4        0       1
5      59000    5        1       0
6      52000    5        1       0
7      72000    6        1       0
8      91000    8        1       0
9      67000    6        0       0
10     83000    7        0       0
11     79000    7        0       0
12     59000    5        0       0

In [80]:
y = final.Price
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Price, dtype: int64

In [81]:
model.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [82]:
model.score(X,y)

0.9417050937281083

In [84]:
#Price of mercedez benz that is 4 yr old with mileage 45000
model.predict([[45000,4,0,0]])

array([36991.31721061])

In [85]:
#Price of BMW X5 that is 7 yr old with mileage 86000
model.predict([[86000,7,0,1]])

array([11080.74313219])